# Анализ базы данных

**Краткое описание проекта**

Необходимо проанализировать базу данных.
В ней — информация о книгах, издательствах, авторах, а также пользовательские обзоры книг. 

**Цель проекта**

Проанализировать базу данных.Эти данные помогут сформулировать ценностное предложение для нового продукта.

**Описание данных**

**Таблица `books`**

Содержит данные о книгах:

- `book_id` — идентификатор книги;
- `author_id` — идентификатор автора;
- `title` — название книги;
- `num_pages` — количество страниц;
- `publication_date` — дата публикации книги;
- `publisher_id` — идентификатор издателя.

**Таблица `authors`**

Содержит данные об авторах:

- `author_id` — идентификатор автора;
- `author` — имя автора.

**Таблица `publishers`**

Содержит данные об издательствах:

- `publisher_id` — идентификатор издательства;
- `publisher` — название издательства;

**Таблица `ratings`**

Содержит данные о пользовательских оценках книг:

- `rating_id` — идентификатор оценки;
- `book_id` — идентификатор книги;
- `username` — имя пользователя, оставившего оценку;
- `rating` — оценка книги.

**Таблица `reviews`**

Содержит данные о пользовательских обзорах на книги:

- `review_id` — идентификатор обзора;
- `book_id` — идентификатор книги;
- `username` — имя пользователя, написавшего обзор;
- `text` — текст обзора.

## Открытие данных и их изучение

In [1]:
# импортируем библиотеки
import pandas as pd
from sqlalchemy import text, create_engine

# устанавливаем параметры
db_config = {'user': 'praktikum_student', # имя пользователя
'pwd': 'Sdf4$2;d-d30pp', # пароль
'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
'port': 6432, # порт подключения
'db': 'data-analyst-final-project-db'} # название базы данных
connection_string = 'postgresql://{user}:{pwd}@{host}:{port}/{db}'.format(**db_config)

# сохраняем коннектор
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

In [2]:
# выведем первые 5 строк таблицы books
query = '''
    SELECT *
    FROM books
    LIMIT 5
'''

con=engine.connect()

pd.io.sql.read_sql(sql=text(query), con = con)

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

In [3]:
# выведем первые 5 строк таблицы authors
query = '''
    SELECT *
    FROM authors
    LIMIT 5
'''

pd.io.sql.read_sql(sql=text(query), con = con)

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

In [4]:
# выведем первые 5 строк таблицы publishers
query = '''
    SELECT *
    FROM publishers
    LIMIT 5
'''

pd.io.sql.read_sql(sql=text(query), con = con)

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

In [5]:
# выведем первые 5 строк таблицы ratings
query = '''
    SELECT *
    FROM ratings
    LIMIT 5
'''

pd.io.sql.read_sql(sql=text(query), con = con)

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

In [6]:
# выведем первые 5 строк таблицы reviews
query = '''
    SELECT *
    FROM reviews
    LIMIT 5
'''

pd.io.sql.read_sql(sql=text(query), con = con)

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

Вывод: Мы посмотрели на данные, все соответствует документации. Можно приступать к анализу.

In [7]:
# КОД РЕВЬЮЕРА
# какие ещё таблицы доступны в базе
display(pd.io.sql.read_sql('''

SELECT *
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND
      schemaname != 'information_schema';

''', con = engine))


# смотрим на типы столбцов в интересующих таблицах
display(pd.io.sql.read_sql('''
SELECT 
    table_name, 
    column_name, 
    data_type, 
    is_nullable
FROM INFORMATION_SCHEMA.COLUMNS 
WHERE table_name IN ('books', 'authors', 'publishers', 'ratings', 'reviews');
''', con = engine))

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers,rowsecurity
0,public,orders,praktikum_admin,None,True,False,False,False
1,public,visits,praktikum_admin,None,True,False,False,False
2,public,advertisment_costs,praktikum_admin,None,True,False,False,False
3,public,authors,praktikum_admin,None,True,False,True,False
4,public,second,praktikum_student,None,False,False,False,False
5,public,second_b,praktikum_student,None,False,False,False,False
6,public,publishers,praktikum_admin,None,True,False,True,False
7,public,author,praktikum_student,None,True,False,False,False
8,public,reviews,praktikum_admin,None,True,False,True,False
9,public,ratings,praktikum_admin,None,True,False,True,False
10,public,books,praktikum_admin,None,True,False,True,False

    table_name       column_name data_type is_nullable
0      authors         author_id   integer          NO
1      authors            author      text         YES
2   publishers      publisher_id   integer          NO
3   publishers         publisher      text         YES
4      reviews         review_id   integer          NO
5      reviews           book_id   integer         YES
6      reviews          username      text         YES
7      reviews              text      text         YES
8      ratings         rating_id   integer          NO
9      ratings           book_id   integer         YES
10     ratings          username      text         YES
11     ratings            rating   integer         YES
12       books           book_id   integer          NO
13       books         author_id   integer         YES
14       books             title      text         YES
15       books         num_pages   integer         YES
16       books  publication_date      date         YES
17       books      publisher_id   integer         YES

## Анализ данных

In [8]:
# посчитаем, сколько книг вышло после 1 января 2000 года
query = '''
    SELECT COUNT(book_id)
    FROM books
    WHERE publication_date>'2000-01-01'
'''

pd.io.sql.read_sql(sql=text(query), con = con)

   count
0    819

819 книг вышло после 1 января 2000 года.

In [9]:
# для каждой книги посчитаем количество обзоров и среднюю оценку
query = '''
    SELECT 
        books.book_id,
        title,
        COUNT(DISTINCT review_id) AS cnt_reviews,
        AVG(rating) AS avg_ratings
    FROM books
    LEFT JOIN reviews ON reviews.book_id = books.book_id
    LEFT JOIN ratings ON books.book_id = ratings.book_id
    GROUP BY books.book_id
        
'''

pd.io.sql.read_sql(sql=text(query), con = con)

,book_id,title,cnt_reviews,avg_ratings
0,1,'Salem's Lot,2,3.666667
1,2,1 000 Places to See Before You Die,1,2.500000
2,3,13 Little Blue Envelopes (Little Blue Envelope...,3,4.666667
3,4,1491: New Revelations of the Americas Before C...,2,4.500000
4,5,1776,4,4.000000
...,...,...,...,...
995,996,Wyrd Sisters (Discworld #6; Witches #2),3,3.666667
996,997,Xenocide (Ender's Saga #3),3,3.400000
997,998,Year of Wonders,4,3.200000
998,999,You Suck (A Love Story #2),2,4.500000
999,1000,Zen and the Art of Motorcycle Maintenance: An ...,4,3.833333

У 1000 книг есть обзоры и/или средняя оценка

In [10]:
# определим издательство, которое выпустило наибольшее число книг толще 50 страниц
query = '''
    SELECT 
        publisher_id,
        publisher
    FROM publishers
    WHERE publisher_id IN(
        SELECT publisher_id
        FROM(
            SELECT 
                publisher_id,
                cnt_books,
                MAX(cnt_books) OVER() AS max_cnt
            FROM(
                SELECT 
                    publisher_id,
                    COUNT(book_id) AS cnt_books
                FROM books
                WHERE num_pages > 50
                GROUP BY publisher_id
            ) AS k
        ) AS a
        WHERE cnt_books=max_cnt)    
'''

pd.io.sql.read_sql(sql=text(query), con = con)

   publisher_id      publisher
0           212  Penguin Books

Издательство Penguin Books выпустило наибольшее число книг толще 50 страниц

In [11]:
# определим автора с самой высокой средней оценкой книг — учтем только книги с 50 и более оценками
query = '''
    SELECT 
        author_id,
        author,
        avg_rating
    FROM(
        SELECT 
            author_id,
            author,
            avg_rating,
            MAX(avg_rating) OVER() AS max_avg_rating
        FROM(
            SELECT
                authors.author_id,
                author,
                AVG(rating) AS avg_rating
            FROM books
            JOIN authors ON authors.author_id = books.author_id
            LEFT JOIN ratings ON ratings.book_id = books.book_id
            WHERE books.book_id IN(
                SELECT 
                    book_id
                FROM ratings
                GROUP BY book_id
                HAVING COUNT(rating_id)>=50
            )
            GROUP BY
                authors.author_id,
                author
            ) AS s
        ) AS a
    WHERE avg_rating = max_avg_rating
      
'''

pd.io.sql.read_sql(sql=text(query), con = con)

   author_id                      author  avg_rating
0        236  J.K. Rowling/Mary GrandPré    4.287097

J.K. Rowling/Mary GrandPré - автор с самой высокой средней оценкой книг (4.3) с 50 и более оценками

In [12]:
# посчитаем среднее количество обзоров от пользователей, которые поставили больше 48 оценок
query = '''
    SELECT AVG(cnt_reviews) AS avg_cnt_reviews
    FROM (
        SELECT 
            username,
            COUNT(review_id) AS cnt_reviews
        FROM reviews
        WHERE username IN (
            SELECT username
            FROM ratings
            GROUP BY username
            HAVING COUNT(rating_id)>48)
        GROUP BY username
    ) AS a
    
    
'''

pd.io.sql.read_sql(sql=text(query), con = con)

   avg_cnt_reviews
0             24.0

В среднем 24 обзора оставили пользователи, которые поставили больше 48 оценок

## Вывод

Мы проанализировали данные и получили такой результат:
- 819 книг вышло после 1 января 2000 года;
- У 1000 книг есть обзоры и/или средняя оценка;
- Издательство Penguin Books выпустило наибольшее число книг толще 50 страниц;
- J.K. Rowling/Mary GrandPré - автор с самой высокой средней оценкой книг (4.3) с 50 и более оценками;
- В среднем 24 обзора оставили пользователи, которые поставили больше 48 оценок.